MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f256h.h
extern volatile __DCH5CONbits_t DCH5CONbits __asm__ ("DCH5CON") __attribute__((section("sfrs"), address(0xBF883420)));
extern volatile uint32_t        DCH5CONCLR __attribute__((section("sfrs"),address(0xBF883424)));
extern volatile uint32_t        DCH5CONSET __attribute__((section("sfrs"),address(0xBF883428)));
extern volatile uint32_t        DCH5CONINV __attribute__((section("sfrs"),address(0xBF88342C)));
#define DCH5ECON DCH5ECON
extern volatile uint32_t   DCH5ECON __attribute__((section("sfrs"), address(0xBF883430)));
typedef union {
  struct {
    uint32_t :3;
    uint32_t AIRQEN:1;
    uint32_t SIRQEN:1;
    uint32_t PATEN:1;
    uint32_t CABORT:1;
    uint32_t CFORCE:1;
    uint32_t CHSIRQ:8;
    uint32_t CHAIRQ:8;
  };
  struct {
    uint32_t w:32;
  };
} __DCH5ECONbits_t;
extern volatile __DCH5ECONbits_t DCH5ECONbits __asm__ ("DCH5ECON") __attribute__((section("sfrs"), address(0xBF883430)));
extern volatile uint32_t        DCH5ECONCLR __attribute__((section("sfrs"),address(0xBF883434)));
extern volatile uint32_t        DCH5ECONSET __attribute__((section("sfrs"),address(0xBF883438)));
extern volatile uint32_t        DCH5ECONINV __attribute__((section("sfrs"),address(0xBF88343C)));
#define DCH5INT DCH5INT
extern volatile uint32_t   DCH5INT __attribute__((section("sfrs"), address(0xBF883440)));
typedef union {
  struct {
    uint32_t CHERIF:1;
    uint32_t CHTAIF:1;
    uint32_t CHCCIF:1;
    uint32_t CHBCIF:1;
    uint32_t CHDHIF:1;
    uint32_t CHDDIF:1;
    uint32_t CHSHIF:1;
    uint32_t CHSDIF:1;
    uint32_t :8;
    uint32_t CHERIE:1;
    uint32_t CHTAIE:1;
    uint32_t CHCCIE:1;
    uint32_t CHBCIE:1;
    uint32_t CHDHIE:1;
    uint32_t CHDDIE:1;
    uint32_t CHSHIE:1;
    uint32_t CHSDIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __DCH5INTbits_t;
extern volatile __DCH5INTbits_t DCH5INTbits __asm__ ("DCH5INT") __attribute__((section("sfrs"), address(0xBF883440)));
extern volatile uint32_t        DCH5INTCLR __attribute__((section("sfrs"),address(0xBF883444)));
extern volatile uint32_t        DCH5INTSET __attribute__((section("sfrs"),address(0xBF883448)));
extern volatile uint32_t        DCH5INTINV __attribute__((section("sfrs"),address(0xBF88344C)));
#define DCH5SSA DCH5SSA
extern volatile uint32_t   DCH5SSA __attribute__((section("sfrs"), address(0xBF883450)));
typedef struct {
  uint32_t CHSSA:32;
} __DCH5SSAbits_t;
extern volatile __DCH5SSAbits_t DCH5SSAbits __asm__ ("DCH5SSA") __attribute__((section("sfrs"), address(0xBF883450)));
extern volatile uint32_t        DCH5SSACLR __attribute__((section("sfrs"),address(0xBF883454)));
extern volatile uint32_t        DCH5SSASET __attribute__((section("sfrs"),address(0xBF883458)));
extern volatile uint32_t        DCH5SSAINV __attribute__((section("sfrs"),address(0xBF88345C)));
#define DCH5DSA DCH5DSA
extern volatile uint32_t   DCH5DSA __attribute__((section("sfrs"), address(0xBF883460)));
typedef struct {
  uint32_t CHDSA:32;
} __DCH5DSAbits_t;
extern volatile __DCH5DSAbits_t DCH5DSAbits __asm__ ("DCH5DSA") __attribute__((section("sfrs"), address(0xBF883460)));
extern volatile uint32_t        DCH5DSACLR __attribute__((section("sfrs"),address(0xBF883464)));
extern volatile uint32_t        DCH5DSASET __attribute__((section("sfrs"),address(0xBF883468)));
extern volatile uint32_t        DCH5DSAINV __attribute__((section("sfrs"),address(0xBF88346C)));
#define DCH5SSIZ DCH5SSIZ
extern volatile uint32_t   DCH5SSIZ __attribute__((section("sfrs"), address(0xBF883470)));
extern volatile uint32_t        DCH5SSIZCLR __attribute__((section("sfrs"),address(0xBF883474)));
extern volatile uint32_t        DCH5SSIZSET __attribute__((section("sfrs"),address(0xBF883478)));
extern volatile uint32_t        DCH5SSIZINV __attribute__((section("sfrs"),address(0xBF88347C)));
#define DCH5DSIZ DCH5DSIZ
extern volatile uint32_t   DCH5DSIZ __attribute__((section("sfrs"), address(0xBF883480)));
extern volatile uint32_t        DCH5DSIZCLR __attribute__((section("sfrs"),address(0xBF883484)));
extern volatile uint32_t        DCH5DSIZSET __attribute__((section("sfrs"),address(0xBF883488)));
extern volatile uint32_t        DCH5DSIZINV __attribute__((section("sfrs"),address(0xBF88348C)));
#define DCH5SPTR DCH5SPTR
extern volatile uint32_t   DCH5SPTR __attribute__((section("sfrs"), address(0xBF883490)));
extern volatile uint32_t        DCH5SPTRCLR __attribute__((section("sfrs"),address(0xBF883494)));
extern volatile uint32_t        DCH5SPTRSET __attribute__((section("sfrs"),address(0xBF883498)));
extern volatile uint32_t        DCH5SPTRINV __attribute__((section("sfrs"),address(0xBF88349C)));
#define DCH5DPTR DCH5DPTR
extern volatile uint32_t   DCH5DPTR __attribute__((section("sfrs"), address(0xBF8834A0)));
extern volatile uint32_t        DCH5DPTRCLR __attribute__((section("sfrs"),address(0xBF8834A4)));
extern volatile uint32_t        DCH5DPTRSET __attribute__((section("sfrs"),address(0xBF8834A8)));
extern volatile uint32_t        DCH5DPTRINV __attribute__((section("sfrs"),address(0xBF8834AC)));
#define DCH5CSIZ DCH5CSIZ
extern volatile uint32_t   DCH5CSIZ __attribute__((section("sfrs"), address(0xBF8834B0)));
extern volatile uint32_t        DCH5CSIZCLR __attribute__((section("sfrs"),address(0xBF8834B4)));
extern volatile uint32_t        DCH5CSIZSET __attribute__((section("sfrs"),address(0xBF8834B8)));
extern volatile uint32_t        DCH5CSIZINV __attribute__((section("sfrs"),address(0xBF8834BC)));
#define DCH5CPTR DCH5CPTR
extern volatile uint32_t   DCH5CPTR __attribute__((section("sfrs"), address(0xBF8834C0)));
extern volatile uint32_t        DCH5CPTRCLR __attribute__((section("sfrs"),address(0xBF8834C4)));
extern volatile uint32_t        DCH5CPTRSET __attribute__((section("sfrs"),address(0xBF8834C8)));
extern volatile uint32_t        DCH5CPTRINV __attribute__((section("sfrs"),address(0xBF8834CC)));
#define DCH5DAT DCH5DAT
extern volatile uint32_t   DCH5DAT __attribute__((section("sfrs"), address(0xBF8834D0)));
extern volatile uint32_t        DCH5DATCLR __attribute__((section("sfrs"),address(0xBF8834D4)));
extern volatile uint32_t        DCH5DATSET __attribute__((section("sfrs"),address(0xBF8834D8)));
extern volatile uint32_t        DCH5DATINV __attribute__((section("sfrs"),address(0xBF8834DC)));
#define DCH6CON DCH6CON
extern volatile uint32_t   DCH6CON __attribute__((section("sfrs"), address(0xBF8834E0)));
typedef union {
  struct {
    uint32_t CHPRI:2;
    uint32_t CHEDET:1;
    uint32_t :1;
    uint32_t CHAEN:1;
    uint32_t CHCHN:1;
    uint32_t CHAED:1;
    uint32_t CHEN:1;
    uint32_t CHCHNS:1;
    uint32_t :6;
    uint32_t CHBUSY:1;
  };
  struct {
    uint32_t w:32;
  };
} __DCH6CONbits_t;
extern volatile __DCH6CONbits_t DCH6CONbits __asm__ ("DCH6CON") __attribute__((section("sfrs"), address(0xBF8834E0)));
extern volatile uint32_t        DCH6CONCLR __attribute__((section("sfrs"),address(0xBF8834E4)));
extern volatile uint32_t        DCH6CONSET __attribute__((section("sfrs"),address(0xBF8834E8)));
extern volatile uint32_t        DCH6CONINV __attribute__((section("sfrs"),address(0xBF8834EC)));
#define DCH6ECON DCH6ECON
extern volatile uint32_t   DCH6ECON __attribute__((section("sfrs"), address(0xBF8834F0)));
typedef union {
  struct {
    uint32_t :3;
    uint32_t AIRQEN:1;
    uint32_t SIRQEN:1;
    uint32_t PATEN:1;
    uint32_t CABORT:1;
    uint32_t CFORCE:1;
    uint32_t CHSIRQ:8;
    uint32_t CHAIRQ:8;
  };
  struct {
    uint32_t w:32;
  };
} __DCH6ECONbits_t;
extern volatile __DCH6ECONbits_t DCH6ECONbits __asm__ ("DCH6ECON") __attribute__((section("sfrs"), address(0xBF8834F0)));
extern volatile uint32_t        DCH6ECONCLR __attribute__((section("sfrs"),address(0xBF8834F4)));
extern volatile uint32_t        DCH6ECONSET __attribute__((section("sfrs"),address(0xBF8834F8)));
extern volatile uint32_t        DCH6ECONINV __attribute__((section("sfrs"),address(0xBF8834FC)));
#define DCH6INT DCH6INT
extern volatile uint32_t   DCH6INT __attribute__((section("sfrs"), address(0xBF883500)));
typedef union {
  struct {
    uint32_t CHERIF:1;
    uint32_t CHTAIF:1;
    uint32_t CHCCIF:1;
    uint32_t CHBCIF:1;
    uint32_t CHDHIF:1;
    uint32_t CHDDIF:1;
    uint32_t CHSHIF:1;
    uint32_t CHSDIF:1;
    uint32_t :8;
    uint32_t CHERIE:1;
    uint32_t CHTAIE:1;
    uint32_t CHCCIE:1;
    uint32_t CHBCIE:1;
    uint32_t CHDHIE:1;
    uint32_t CHDDIE:1;
    uint32_t CHSHIE:1;
    uint32_t CHSDIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __DCH6INTbits_t;
extern volatile __DCH6INTbits_t DCH6INTbits __asm__ ("DCH6INT") __attribute__((section("sfrs"), address(0xBF883500)));
extern volatile uint32_t        DCH6INTCLR __attribute__((section("sfrs"),address(0xBF883504)));
extern volatile uint32_t        DCH6INTSET __attribute__((section("sfrs"),address(0xBF883508)));
extern volatile uint32_t        DCH6INTINV __attribute__((section("sfrs"),address(0xBF88350C)));
#define DCH6SSA DCH6SSA
extern volatile uint32_t   DCH6SSA __attribute__((section("sfrs"), address(0xBF883510)));
typedef struct {
  uint32_t CHSSA:32;
} __DCH6SSAbits_t;
extern volatile __DCH6SSAbits_t DCH6SSAbits __asm__ ("DCH6SSA") __attribute__((section("sfrs"), address(0xBF883510)));
extern volatile uint32_t        DCH6SSACLR __attribute__((section("sfrs"),address(0xBF883514)));
extern volatile uint32_t        DCH6SSASET __attribute__((section("sfrs"),address(0xBF883518)));
extern volatile uint32_t        DCH6SSAINV __attribute__((section("sfrs"),address(0xBF88351C)));
#define DCH6DSA DCH6DSA
extern volatile uint32_t   DCH6DSA __attribute__((section("sfrs"), address(0xBF883520)));
typedef struct {
  uint32_t CHDSA:32;
} __DCH6DSAbits_t;
