MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f256h.h
extern volatile __C1RXF27bits_t C1RXF27bits __asm__ ("C1RXF27") __attribute__((section("sfrs"), address(0xBF88B2F0)));
extern volatile uint32_t        C1RXF27CLR __attribute__((section("sfrs"),address(0xBF88B2F4)));
extern volatile uint32_t        C1RXF27SET __attribute__((section("sfrs"),address(0xBF88B2F8)));
extern volatile uint32_t        C1RXF27INV __attribute__((section("sfrs"),address(0xBF88B2FC)));
#define C1RXF28 C1RXF28
extern volatile uint32_t   C1RXF28 __attribute__((section("sfrs"), address(0xBF88B300)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF28bits_t;
extern volatile __C1RXF28bits_t C1RXF28bits __asm__ ("C1RXF28") __attribute__((section("sfrs"), address(0xBF88B300)));
extern volatile uint32_t        C1RXF28CLR __attribute__((section("sfrs"),address(0xBF88B304)));
extern volatile uint32_t        C1RXF28SET __attribute__((section("sfrs"),address(0xBF88B308)));
extern volatile uint32_t        C1RXF28INV __attribute__((section("sfrs"),address(0xBF88B30C)));
#define C1RXF29 C1RXF29
extern volatile uint32_t   C1RXF29 __attribute__((section("sfrs"), address(0xBF88B310)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF29bits_t;
extern volatile __C1RXF29bits_t C1RXF29bits __asm__ ("C1RXF29") __attribute__((section("sfrs"), address(0xBF88B310)));
extern volatile uint32_t        C1RXF29CLR __attribute__((section("sfrs"),address(0xBF88B314)));
extern volatile uint32_t        C1RXF29SET __attribute__((section("sfrs"),address(0xBF88B318)));
extern volatile uint32_t        C1RXF29INV __attribute__((section("sfrs"),address(0xBF88B31C)));
#define C1RXF30 C1RXF30
extern volatile uint32_t   C1RXF30 __attribute__((section("sfrs"), address(0xBF88B320)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF30bits_t;
extern volatile __C1RXF30bits_t C1RXF30bits __asm__ ("C1RXF30") __attribute__((section("sfrs"), address(0xBF88B320)));
extern volatile uint32_t        C1RXF30CLR __attribute__((section("sfrs"),address(0xBF88B324)));
extern volatile uint32_t        C1RXF30SET __attribute__((section("sfrs"),address(0xBF88B328)));
extern volatile uint32_t        C1RXF30INV __attribute__((section("sfrs"),address(0xBF88B32C)));
#define C1RXF31 C1RXF31
extern volatile uint32_t   C1RXF31 __attribute__((section("sfrs"), address(0xBF88B330)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF31bits_t;
extern volatile __C1RXF31bits_t C1RXF31bits __asm__ ("C1RXF31") __attribute__((section("sfrs"), address(0xBF88B330)));
extern volatile uint32_t        C1RXF31CLR __attribute__((section("sfrs"),address(0xBF88B334)));
extern volatile uint32_t        C1RXF31SET __attribute__((section("sfrs"),address(0xBF88B338)));
extern volatile uint32_t        C1RXF31INV __attribute__((section("sfrs"),address(0xBF88B33C)));
#define C1FIFOBA C1FIFOBA
extern volatile uint32_t   C1FIFOBA __attribute__((section("sfrs"), address(0xBF88B340)));
extern volatile uint32_t        C1FIFOBACLR __attribute__((section("sfrs"),address(0xBF88B344)));
extern volatile uint32_t        C1FIFOBASET __attribute__((section("sfrs"),address(0xBF88B348)));
extern volatile uint32_t        C1FIFOBAINV __attribute__((section("sfrs"),address(0xBF88B34C)));
#define C1FIFOCON0 C1FIFOCON0
extern volatile uint32_t   C1FIFOCON0 __attribute__((section("sfrs"), address(0xBF88B350)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON0bits_t;
extern volatile __C1FIFOCON0bits_t C1FIFOCON0bits __asm__ ("C1FIFOCON0") __attribute__((section("sfrs"), address(0xBF88B350)));
extern volatile uint32_t        C1FIFOCON0CLR __attribute__((section("sfrs"),address(0xBF88B354)));
extern volatile uint32_t        C1FIFOCON0SET __attribute__((section("sfrs"),address(0xBF88B358)));
extern volatile uint32_t        C1FIFOCON0INV __attribute__((section("sfrs"),address(0xBF88B35C)));
#define C1FIFOINT0 C1FIFOINT0
extern volatile uint32_t   C1FIFOINT0 __attribute__((section("sfrs"), address(0xBF88B360)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT0bits_t;
extern volatile __C1FIFOINT0bits_t C1FIFOINT0bits __asm__ ("C1FIFOINT0") __attribute__((section("sfrs"), address(0xBF88B360)));
extern volatile uint32_t        C1FIFOINT0CLR __attribute__((section("sfrs"),address(0xBF88B364)));
extern volatile uint32_t        C1FIFOINT0SET __attribute__((section("sfrs"),address(0xBF88B368)));
extern volatile uint32_t        C1FIFOINT0INV __attribute__((section("sfrs"),address(0xBF88B36C)));
#define C1FIFOUA0 C1FIFOUA0
extern volatile uint32_t   C1FIFOUA0 __attribute__((section("sfrs"), address(0xBF88B370)));
extern volatile uint32_t        C1FIFOUA0CLR __attribute__((section("sfrs"),address(0xBF88B374)));
extern volatile uint32_t        C1FIFOUA0SET __attribute__((section("sfrs"),address(0xBF88B378)));
extern volatile uint32_t        C1FIFOUA0INV __attribute__((section("sfrs"),address(0xBF88B37C)));
#define C1FIFOCI0 C1FIFOCI0
extern volatile uint32_t   C1FIFOCI0 __attribute__((section("sfrs"), address(0xBF88B380)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI0bits_t;
extern volatile __C1FIFOCI0bits_t C1FIFOCI0bits __asm__ ("C1FIFOCI0") __attribute__((section("sfrs"), address(0xBF88B380)));
extern volatile uint32_t        C1FIFOCI0CLR __attribute__((section("sfrs"),address(0xBF88B384)));
extern volatile uint32_t        C1FIFOCI0SET __attribute__((section("sfrs"),address(0xBF88B388)));
extern volatile uint32_t        C1FIFOCI0INV __attribute__((section("sfrs"),address(0xBF88B38C)));
#define C1FIFOCON1 C1FIFOCON1
extern volatile uint32_t   C1FIFOCON1 __attribute__((section("sfrs"), address(0xBF88B390)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON1bits_t;
extern volatile __C1FIFOCON1bits_t C1FIFOCON1bits __asm__ ("C1FIFOCON1") __attribute__((section("sfrs"), address(0xBF88B390)));
extern volatile uint32_t        C1FIFOCON1CLR __attribute__((section("sfrs"),address(0xBF88B394)));
extern volatile uint32_t        C1FIFOCON1SET __attribute__((section("sfrs"),address(0xBF88B398)));
extern volatile uint32_t        C1FIFOCON1INV __attribute__((section("sfrs"),address(0xBF88B39C)));
#define C1FIFOINT1 C1FIFOINT1
extern volatile uint32_t   C1FIFOINT1 __attribute__((section("sfrs"), address(0xBF88B3A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT1bits_t;
