MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f256h.h
extern volatile __C1FIFOCI24bits_t C1FIFOCI24bits __asm__ ("C1FIFOCI24") __attribute__((section("sfrs"), address(0xBF88B980)));
extern volatile uint32_t        C1FIFOCI24CLR __attribute__((section("sfrs"),address(0xBF88B984)));
extern volatile uint32_t        C1FIFOCI24SET __attribute__((section("sfrs"),address(0xBF88B988)));
extern volatile uint32_t        C1FIFOCI24INV __attribute__((section("sfrs"),address(0xBF88B98C)));
#define C1FIFOCON25 C1FIFOCON25
extern volatile uint32_t   C1FIFOCON25 __attribute__((section("sfrs"), address(0xBF88B990)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON25bits_t;
extern volatile __C1FIFOCON25bits_t C1FIFOCON25bits __asm__ ("C1FIFOCON25") __attribute__((section("sfrs"), address(0xBF88B990)));
extern volatile uint32_t        C1FIFOCON25CLR __attribute__((section("sfrs"),address(0xBF88B994)));
extern volatile uint32_t        C1FIFOCON25SET __attribute__((section("sfrs"),address(0xBF88B998)));
extern volatile uint32_t        C1FIFOCON25INV __attribute__((section("sfrs"),address(0xBF88B99C)));
#define C1FIFOINT25 C1FIFOINT25
extern volatile uint32_t   C1FIFOINT25 __attribute__((section("sfrs"), address(0xBF88B9A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT25bits_t;
extern volatile __C1FIFOINT25bits_t C1FIFOINT25bits __asm__ ("C1FIFOINT25") __attribute__((section("sfrs"), address(0xBF88B9A0)));
extern volatile uint32_t        C1FIFOINT25CLR __attribute__((section("sfrs"),address(0xBF88B9A4)));
extern volatile uint32_t        C1FIFOINT25SET __attribute__((section("sfrs"),address(0xBF88B9A8)));
extern volatile uint32_t        C1FIFOINT25INV __attribute__((section("sfrs"),address(0xBF88B9AC)));
#define C1FIFOUA25 C1FIFOUA25
extern volatile uint32_t   C1FIFOUA25 __attribute__((section("sfrs"), address(0xBF88B9B0)));
extern volatile uint32_t        C1FIFOUA25CLR __attribute__((section("sfrs"),address(0xBF88B9B4)));
extern volatile uint32_t        C1FIFOUA25SET __attribute__((section("sfrs"),address(0xBF88B9B8)));
extern volatile uint32_t        C1FIFOUA25INV __attribute__((section("sfrs"),address(0xBF88B9BC)));
#define C1FIFOCI25 C1FIFOCI25
extern volatile uint32_t   C1FIFOCI25 __attribute__((section("sfrs"), address(0xBF88B9C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI25bits_t;
extern volatile __C1FIFOCI25bits_t C1FIFOCI25bits __asm__ ("C1FIFOCI25") __attribute__((section("sfrs"), address(0xBF88B9C0)));
extern volatile uint32_t        C1FIFOCI25CLR __attribute__((section("sfrs"),address(0xBF88B9C4)));
extern volatile uint32_t        C1FIFOCI25SET __attribute__((section("sfrs"),address(0xBF88B9C8)));
extern volatile uint32_t        C1FIFOCI25INV __attribute__((section("sfrs"),address(0xBF88B9CC)));
#define C1FIFOCON26 C1FIFOCON26
extern volatile uint32_t   C1FIFOCON26 __attribute__((section("sfrs"), address(0xBF88B9D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON26bits_t;
extern volatile __C1FIFOCON26bits_t C1FIFOCON26bits __asm__ ("C1FIFOCON26") __attribute__((section("sfrs"), address(0xBF88B9D0)));
extern volatile uint32_t        C1FIFOCON26CLR __attribute__((section("sfrs"),address(0xBF88B9D4)));
extern volatile uint32_t        C1FIFOCON26SET __attribute__((section("sfrs"),address(0xBF88B9D8)));
extern volatile uint32_t        C1FIFOCON26INV __attribute__((section("sfrs"),address(0xBF88B9DC)));
#define C1FIFOINT26 C1FIFOINT26
extern volatile uint32_t   C1FIFOINT26 __attribute__((section("sfrs"), address(0xBF88B9E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT26bits_t;
extern volatile __C1FIFOINT26bits_t C1FIFOINT26bits __asm__ ("C1FIFOINT26") __attribute__((section("sfrs"), address(0xBF88B9E0)));
extern volatile uint32_t        C1FIFOINT26CLR __attribute__((section("sfrs"),address(0xBF88B9E4)));
extern volatile uint32_t        C1FIFOINT26SET __attribute__((section("sfrs"),address(0xBF88B9E8)));
extern volatile uint32_t        C1FIFOINT26INV __attribute__((section("sfrs"),address(0xBF88B9EC)));
#define C1FIFOUA26 C1FIFOUA26
extern volatile uint32_t   C1FIFOUA26 __attribute__((section("sfrs"), address(0xBF88B9F0)));
extern volatile uint32_t        C1FIFOUA26CLR __attribute__((section("sfrs"),address(0xBF88B9F4)));
extern volatile uint32_t        C1FIFOUA26SET __attribute__((section("sfrs"),address(0xBF88B9F8)));
extern volatile uint32_t        C1FIFOUA26INV __attribute__((section("sfrs"),address(0xBF88B9FC)));
#define C1FIFOCI26 C1FIFOCI26
extern volatile uint32_t   C1FIFOCI26 __attribute__((section("sfrs"), address(0xBF88BA00)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI26bits_t;
extern volatile __C1FIFOCI26bits_t C1FIFOCI26bits __asm__ ("C1FIFOCI26") __attribute__((section("sfrs"), address(0xBF88BA00)));
extern volatile uint32_t        C1FIFOCI26CLR __attribute__((section("sfrs"),address(0xBF88BA04)));
extern volatile uint32_t        C1FIFOCI26SET __attribute__((section("sfrs"),address(0xBF88BA08)));
extern volatile uint32_t        C1FIFOCI26INV __attribute__((section("sfrs"),address(0xBF88BA0C)));
#define C1FIFOCON27 C1FIFOCON27
extern volatile uint32_t   C1FIFOCON27 __attribute__((section("sfrs"), address(0xBF88BA10)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON27bits_t;
extern volatile __C1FIFOCON27bits_t C1FIFOCON27bits __asm__ ("C1FIFOCON27") __attribute__((section("sfrs"), address(0xBF88BA10)));
extern volatile uint32_t        C1FIFOCON27CLR __attribute__((section("sfrs"),address(0xBF88BA14)));
extern volatile uint32_t        C1FIFOCON27SET __attribute__((section("sfrs"),address(0xBF88BA18)));
extern volatile uint32_t        C1FIFOCON27INV __attribute__((section("sfrs"),address(0xBF88BA1C)));
#define C1FIFOINT27 C1FIFOINT27
extern volatile uint32_t   C1FIFOINT27 __attribute__((section("sfrs"), address(0xBF88BA20)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT27bits_t;
extern volatile __C1FIFOINT27bits_t C1FIFOINT27bits __asm__ ("C1FIFOINT27") __attribute__((section("sfrs"), address(0xBF88BA20)));
extern volatile uint32_t        C1FIFOINT27CLR __attribute__((section("sfrs"),address(0xBF88BA24)));
extern volatile uint32_t        C1FIFOINT27SET __attribute__((section("sfrs"),address(0xBF88BA28)));
extern volatile uint32_t        C1FIFOINT27INV __attribute__((section("sfrs"),address(0xBF88BA2C)));
#define C1FIFOUA27 C1FIFOUA27
extern volatile uint32_t   C1FIFOUA27 __attribute__((section("sfrs"), address(0xBF88BA30)));
extern volatile uint32_t        C1FIFOUA27CLR __attribute__((section("sfrs"),address(0xBF88BA34)));
extern volatile uint32_t        C1FIFOUA27SET __attribute__((section("sfrs"),address(0xBF88BA38)));
extern volatile uint32_t        C1FIFOUA27INV __attribute__((section("sfrs"),address(0xBF88BA3C)));
#define C1FIFOCI27 C1FIFOCI27
extern volatile uint32_t   C1FIFOCI27 __attribute__((section("sfrs"), address(0xBF88BA40)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI27bits_t;
extern volatile __C1FIFOCI27bits_t C1FIFOCI27bits __asm__ ("C1FIFOCI27") __attribute__((section("sfrs"), address(0xBF88BA40)));
extern volatile uint32_t        C1FIFOCI27CLR __attribute__((section("sfrs"),address(0xBF88BA44)));
extern volatile uint32_t        C1FIFOCI27SET __attribute__((section("sfrs"),address(0xBF88BA48)));
extern volatile uint32_t        C1FIFOCI27INV __attribute__((section("sfrs"),address(0xBF88BA4C)));
#define C1FIFOCON28 C1FIFOCON28
extern volatile uint32_t   C1FIFOCON28 __attribute__((section("sfrs"), address(0xBF88BA50)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON28bits_t;
extern volatile __C1FIFOCON28bits_t C1FIFOCON28bits __asm__ ("C1FIFOCON28") __attribute__((section("sfrs"), address(0xBF88BA50)));
extern volatile uint32_t        C1FIFOCON28CLR __attribute__((section("sfrs"),address(0xBF88BA54)));
extern volatile uint32_t        C1FIFOCON28SET __attribute__((section("sfrs"),address(0xBF88BA58)));
extern volatile uint32_t        C1FIFOCON28INV __attribute__((section("sfrs"),address(0xBF88BA5C)));
#define C1FIFOINT28 C1FIFOINT28
extern volatile uint32_t   C1FIFOINT28 __attribute__((section("sfrs"), address(0xBF88BA60)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT28bits_t;
extern volatile __C1FIFOINT28bits_t C1FIFOINT28bits __asm__ ("C1FIFOINT28") __attribute__((section("sfrs"), address(0xBF88BA60)));
extern volatile uint32_t        C1FIFOINT28CLR __attribute__((section("sfrs"),address(0xBF88BA64)));
extern volatile uint32_t        C1FIFOINT28SET __attribute__((section("sfrs"),address(0xBF88BA68)));
extern volatile uint32_t        C1FIFOINT28INV __attribute__((section("sfrs"),address(0xBF88BA6C)));
#define C1FIFOUA28 C1FIFOUA28
extern volatile uint32_t   C1FIFOUA28 __attribute__((section("sfrs"), address(0xBF88BA70)));
extern volatile uint32_t        C1FIFOUA28CLR __attribute__((section("sfrs"),address(0xBF88BA74)));
extern volatile uint32_t        C1FIFOUA28SET __attribute__((section("sfrs"),address(0xBF88BA78)));
extern volatile uint32_t        C1FIFOUA28INV __attribute__((section("sfrs"),address(0xBF88BA7C)));
#define C1FIFOCI28 C1FIFOCI28
extern volatile uint32_t   C1FIFOCI28 __attribute__((section("sfrs"), address(0xBF88BA80)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI28bits_t;
extern volatile __C1FIFOCI28bits_t C1FIFOCI28bits __asm__ ("C1FIFOCI28") __attribute__((section("sfrs"), address(0xBF88BA80)));
extern volatile uint32_t        C1FIFOCI28CLR __attribute__((section("sfrs"),address(0xBF88BA84)));
extern volatile uint32_t        C1FIFOCI28SET __attribute__((section("sfrs"),address(0xBF88BA88)));
extern volatile uint32_t        C1FIFOCI28INV __attribute__((section("sfrs"),address(0xBF88BA8C)));
#define C1FIFOCON29 C1FIFOCON29
extern volatile uint32_t   C1FIFOCON29 __attribute__((section("sfrs"), address(0xBF88BA90)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON29bits_t;
