MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f256h.h
extern volatile __C2TRECbits_t C2TRECbits __asm__ ("C2TREC") __attribute__((section("sfrs"), address(0xBF88C040)));
extern volatile uint32_t        C2TRECCLR __attribute__((section("sfrs"),address(0xBF88C044)));
extern volatile uint32_t        C2TRECSET __attribute__((section("sfrs"),address(0xBF88C048)));
extern volatile uint32_t        C2TRECINV __attribute__((section("sfrs"),address(0xBF88C04C)));
#define C2FSTAT C2FSTAT
extern volatile uint32_t   C2FSTAT __attribute__((section("sfrs"), address(0xBF88C050)));
typedef union {
  struct {
    uint32_t FIFOIP:32;
  };
  struct {
    uint32_t FIFOIP0:1;
    uint32_t FIFOIP1:1;
    uint32_t FIFOIP2:1;
    uint32_t FIFOIP3:1;
    uint32_t FIFOIP4:1;
    uint32_t FIFOIP5:1;
    uint32_t FIFOIP6:1;
    uint32_t FIFOIP7:1;
    uint32_t FIFOIP8:1;
    uint32_t FIFOIP9:1;
    uint32_t FIFOIP10:1;
    uint32_t FIFOIP11:1;
    uint32_t FIFOIP12:1;
    uint32_t FIFOIP13:1;
    uint32_t FIFOIP14:1;
    uint32_t FIFOIP15:1;
    uint32_t FIFOIP16:1;
    uint32_t FIFOIP17:1;
    uint32_t FIFOIP18:1;
    uint32_t FIFOIP19:1;
    uint32_t FIFOIP20:1;
    uint32_t FIFOIP21:1;
    uint32_t FIFOIP22:1;
    uint32_t FIFOIP23:1;
    uint32_t FIFOIP24:1;
    uint32_t FIFOIP25:1;
    uint32_t FIFOIP26:1;
    uint32_t FIFOIP27:1;
    uint32_t FIFOIP28:1;
    uint32_t FIFOIP29:1;
    uint32_t FIFOIP30:1;
    uint32_t FIFOIP31:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FSTATbits_t;
extern volatile __C2FSTATbits_t C2FSTATbits __asm__ ("C2FSTAT") __attribute__((section("sfrs"), address(0xBF88C050)));
extern volatile uint32_t        C2FSTATCLR __attribute__((section("sfrs"),address(0xBF88C054)));
extern volatile uint32_t        C2FSTATSET __attribute__((section("sfrs"),address(0xBF88C058)));
extern volatile uint32_t        C2FSTATINV __attribute__((section("sfrs"),address(0xBF88C05C)));
#define C2RXOVF C2RXOVF
extern volatile uint32_t   C2RXOVF __attribute__((section("sfrs"), address(0xBF88C060)));
typedef union {
  struct {
    uint32_t RXOVF:32;
  };
  struct {
    uint32_t RXOVF0:1;
    uint32_t RXOVF1:1;
    uint32_t RXOVF2:1;
    uint32_t RXOVF3:1;
    uint32_t RXOVF4:1;
    uint32_t RXOVF5:1;
    uint32_t RXOVF6:1;
    uint32_t RXOVF7:1;
    uint32_t RXOVF8:1;
    uint32_t RXOVF9:1;
    uint32_t RXOVF10:1;
    uint32_t RXOVF11:1;
    uint32_t RXOVF12:1;
    uint32_t RXOVF13:1;
    uint32_t RXOVF14:1;
    uint32_t RXOVF15:1;
    uint32_t RXOVF16:1;
    uint32_t RXOVF17:1;
    uint32_t RXOVF18:1;
    uint32_t RXOVF19:1;
    uint32_t RXOVF20:1;
    uint32_t RXOVF21:1;
    uint32_t RXOVF22:1;
    uint32_t RXOVF23:1;
    uint32_t RXOVF24:1;
    uint32_t RXOVF25:1;
    uint32_t RXOVF26:1;
    uint32_t RXOVF27:1;
    uint32_t RXOVF28:1;
    uint32_t RXOVF29:1;
    uint32_t RXOVF30:1;
    uint32_t RXOVF31:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXOVFbits_t;
extern volatile __C2RXOVFbits_t C2RXOVFbits __asm__ ("C2RXOVF") __attribute__((section("sfrs"), address(0xBF88C060)));
extern volatile uint32_t        C2RXOVFCLR __attribute__((section("sfrs"),address(0xBF88C064)));
extern volatile uint32_t        C2RXOVFSET __attribute__((section("sfrs"),address(0xBF88C068)));
extern volatile uint32_t        C2RXOVFINV __attribute__((section("sfrs"),address(0xBF88C06C)));
#define C2TMR C2TMR
extern volatile uint32_t   C2TMR __attribute__((section("sfrs"), address(0xBF88C070)));
typedef union {
  struct {
    uint32_t CANTSPRE:16;
    uint32_t CANTS:16;
  };
  struct {
    uint32_t w:32;
  };
} __C2TMRbits_t;
extern volatile __C2TMRbits_t C2TMRbits __asm__ ("C2TMR") __attribute__((section("sfrs"), address(0xBF88C070)));
extern volatile uint32_t        C2TMRCLR __attribute__((section("sfrs"),address(0xBF88C074)));
extern volatile uint32_t        C2TMRSET __attribute__((section("sfrs"),address(0xBF88C078)));
extern volatile uint32_t        C2TMRINV __attribute__((section("sfrs"),address(0xBF88C07C)));
#define C2RXM0 C2RXM0
extern volatile uint32_t   C2RXM0 __attribute__((section("sfrs"), address(0xBF88C080)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXM0bits_t;
extern volatile __C2RXM0bits_t C2RXM0bits __asm__ ("C2RXM0") __attribute__((section("sfrs"), address(0xBF88C080)));
extern volatile uint32_t        C2RXM0CLR __attribute__((section("sfrs"),address(0xBF88C084)));
extern volatile uint32_t        C2RXM0SET __attribute__((section("sfrs"),address(0xBF88C088)));
extern volatile uint32_t        C2RXM0INV __attribute__((section("sfrs"),address(0xBF88C08C)));
#define C2RXM1 C2RXM1
extern volatile uint32_t   C2RXM1 __attribute__((section("sfrs"), address(0xBF88C090)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXM1bits_t;
extern volatile __C2RXM1bits_t C2RXM1bits __asm__ ("C2RXM1") __attribute__((section("sfrs"), address(0xBF88C090)));
extern volatile uint32_t        C2RXM1CLR __attribute__((section("sfrs"),address(0xBF88C094)));
extern volatile uint32_t        C2RXM1SET __attribute__((section("sfrs"),address(0xBF88C098)));
extern volatile uint32_t        C2RXM1INV __attribute__((section("sfrs"),address(0xBF88C09C)));
#define C2RXM2 C2RXM2
extern volatile uint32_t   C2RXM2 __attribute__((section("sfrs"), address(0xBF88C0A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXM2bits_t;
extern volatile __C2RXM2bits_t C2RXM2bits __asm__ ("C2RXM2") __attribute__((section("sfrs"), address(0xBF88C0A0)));
extern volatile uint32_t        C2RXM2CLR __attribute__((section("sfrs"),address(0xBF88C0A4)));
extern volatile uint32_t        C2RXM2SET __attribute__((section("sfrs"),address(0xBF88C0A8)));
extern volatile uint32_t        C2RXM2INV __attribute__((section("sfrs"),address(0xBF88C0AC)));
#define C2RXM3 C2RXM3
extern volatile uint32_t   C2RXM3 __attribute__((section("sfrs"), address(0xBF88C0B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXM3bits_t;
extern volatile __C2RXM3bits_t C2RXM3bits __asm__ ("C2RXM3") __attribute__((section("sfrs"), address(0xBF88C0B0)));
extern volatile uint32_t        C2RXM3CLR __attribute__((section("sfrs"),address(0xBF88C0B4)));
extern volatile uint32_t        C2RXM3SET __attribute__((section("sfrs"),address(0xBF88C0B8)));
extern volatile uint32_t        C2RXM3INV __attribute__((section("sfrs"),address(0xBF88C0BC)));
#define C2FLTCON0 C2FLTCON0
extern volatile uint32_t   C2FLTCON0 __attribute__((section("sfrs"), address(0xBF88C0C0)));
typedef union {
  struct {
    uint32_t FSEL0:5;
    uint32_t MSEL0:2;
    uint32_t FLTEN0:1;
    uint32_t FSEL1:5;
    uint32_t MSEL1:2;
    uint32_t FLTEN1:1;
    uint32_t FSEL2:5;
    uint32_t MSEL2:2;
    uint32_t FLTEN2:1;
    uint32_t FSEL3:5;
    uint32_t MSEL3:2;
    uint32_t FLTEN3:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FLTCON0bits_t;
extern volatile __C2FLTCON0bits_t C2FLTCON0bits __asm__ ("C2FLTCON0") __attribute__((section("sfrs"), address(0xBF88C0C0)));
extern volatile uint32_t        C2FLTCON0CLR __attribute__((section("sfrs"),address(0xBF88C0C4)));
extern volatile uint32_t        C2FLTCON0SET __attribute__((section("sfrs"),address(0xBF88C0C8)));
extern volatile uint32_t        C2FLTCON0INV __attribute__((section("sfrs"),address(0xBF88C0CC)));
#define C2FLTCON1 C2FLTCON1
extern volatile uint32_t   C2FLTCON1 __attribute__((section("sfrs"), address(0xBF88C0D0)));
typedef union {
  struct {
    uint32_t FSEL4:5;
    uint32_t MSEL4:2;
    uint32_t FLTEN4:1;
    uint32_t FSEL5:5;
    uint32_t MSEL5:2;
    uint32_t FLTEN5:1;
    uint32_t FSEL6:5;
    uint32_t MSEL6:2;
    uint32_t FLTEN6:1;
    uint32_t FSEL7:5;
    uint32_t MSEL7:2;
    uint32_t FLTEN7:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FLTCON1bits_t;
extern volatile __C2FLTCON1bits_t C2FLTCON1bits __asm__ ("C2FLTCON1") __attribute__((section("sfrs"), address(0xBF88C0D0)));
extern volatile uint32_t        C2FLTCON1CLR __attribute__((section("sfrs"),address(0xBF88C0D4)));
extern volatile uint32_t        C2FLTCON1SET __attribute__((section("sfrs"),address(0xBF88C0D8)));
extern volatile uint32_t        C2FLTCON1INV __attribute__((section("sfrs"),address(0xBF88C0DC)));
#define C2FLTCON2 C2FLTCON2
extern volatile uint32_t   C2FLTCON2 __attribute__((section("sfrs"), address(0xBF88C0E0)));
typedef union {
  struct {
    uint32_t FSEL8:5;
    uint32_t MSEL8:2;
    uint32_t FLTEN8:1;
    uint32_t FSEL9:5;
    uint32_t MSEL9:2;
    uint32_t FLTEN9:1;
    uint32_t FSEL10:5;
    uint32_t MSEL10:2;
    uint32_t FLTEN10:1;
    uint32_t FSEL11:5;
    uint32_t MSEL11:2;
    uint32_t FLTEN11:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FLTCON2bits_t;
