MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f256h.h
extern volatile __C2RXF2bits_t C2RXF2bits __asm__ ("C2RXF2") __attribute__((section("sfrs"), address(0xBF88C160)));
extern volatile uint32_t        C2RXF2CLR __attribute__((section("sfrs"),address(0xBF88C164)));
extern volatile uint32_t        C2RXF2SET __attribute__((section("sfrs"),address(0xBF88C168)));
extern volatile uint32_t        C2RXF2INV __attribute__((section("sfrs"),address(0xBF88C16C)));
#define C2RXF3 C2RXF3
extern volatile uint32_t   C2RXF3 __attribute__((section("sfrs"), address(0xBF88C170)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF3bits_t;
extern volatile __C2RXF3bits_t C2RXF3bits __asm__ ("C2RXF3") __attribute__((section("sfrs"), address(0xBF88C170)));
extern volatile uint32_t        C2RXF3CLR __attribute__((section("sfrs"),address(0xBF88C174)));
extern volatile uint32_t        C2RXF3SET __attribute__((section("sfrs"),address(0xBF88C178)));
extern volatile uint32_t        C2RXF3INV __attribute__((section("sfrs"),address(0xBF88C17C)));
#define C2RXF4 C2RXF4
extern volatile uint32_t   C2RXF4 __attribute__((section("sfrs"), address(0xBF88C180)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF4bits_t;
extern volatile __C2RXF4bits_t C2RXF4bits __asm__ ("C2RXF4") __attribute__((section("sfrs"), address(0xBF88C180)));
extern volatile uint32_t        C2RXF4CLR __attribute__((section("sfrs"),address(0xBF88C184)));
extern volatile uint32_t        C2RXF4SET __attribute__((section("sfrs"),address(0xBF88C188)));
extern volatile uint32_t        C2RXF4INV __attribute__((section("sfrs"),address(0xBF88C18C)));
#define C2RXF5 C2RXF5
extern volatile uint32_t   C2RXF5 __attribute__((section("sfrs"), address(0xBF88C190)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF5bits_t;
extern volatile __C2RXF5bits_t C2RXF5bits __asm__ ("C2RXF5") __attribute__((section("sfrs"), address(0xBF88C190)));
extern volatile uint32_t        C2RXF5CLR __attribute__((section("sfrs"),address(0xBF88C194)));
extern volatile uint32_t        C2RXF5SET __attribute__((section("sfrs"),address(0xBF88C198)));
extern volatile uint32_t        C2RXF5INV __attribute__((section("sfrs"),address(0xBF88C19C)));
#define C2RXF6 C2RXF6
extern volatile uint32_t   C2RXF6 __attribute__((section("sfrs"), address(0xBF88C1A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF6bits_t;
extern volatile __C2RXF6bits_t C2RXF6bits __asm__ ("C2RXF6") __attribute__((section("sfrs"), address(0xBF88C1A0)));
extern volatile uint32_t        C2RXF6CLR __attribute__((section("sfrs"),address(0xBF88C1A4)));
extern volatile uint32_t        C2RXF6SET __attribute__((section("sfrs"),address(0xBF88C1A8)));
extern volatile uint32_t        C2RXF6INV __attribute__((section("sfrs"),address(0xBF88C1AC)));
#define C2RXF7 C2RXF7
extern volatile uint32_t   C2RXF7 __attribute__((section("sfrs"), address(0xBF88C1B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF7bits_t;
extern volatile __C2RXF7bits_t C2RXF7bits __asm__ ("C2RXF7") __attribute__((section("sfrs"), address(0xBF88C1B0)));
extern volatile uint32_t        C2RXF7CLR __attribute__((section("sfrs"),address(0xBF88C1B4)));
extern volatile uint32_t        C2RXF7SET __attribute__((section("sfrs"),address(0xBF88C1B8)));
extern volatile uint32_t        C2RXF7INV __attribute__((section("sfrs"),address(0xBF88C1BC)));
#define C2RXF8 C2RXF8
extern volatile uint32_t   C2RXF8 __attribute__((section("sfrs"), address(0xBF88C1C0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF8bits_t;
extern volatile __C2RXF8bits_t C2RXF8bits __asm__ ("C2RXF8") __attribute__((section("sfrs"), address(0xBF88C1C0)));
extern volatile uint32_t        C2RXF8CLR __attribute__((section("sfrs"),address(0xBF88C1C4)));
extern volatile uint32_t        C2RXF8SET __attribute__((section("sfrs"),address(0xBF88C1C8)));
extern volatile uint32_t        C2RXF8INV __attribute__((section("sfrs"),address(0xBF88C1CC)));
#define C2RXF9 C2RXF9
extern volatile uint32_t   C2RXF9 __attribute__((section("sfrs"), address(0xBF88C1D0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF9bits_t;
extern volatile __C2RXF9bits_t C2RXF9bits __asm__ ("C2RXF9") __attribute__((section("sfrs"), address(0xBF88C1D0)));
extern volatile uint32_t        C2RXF9CLR __attribute__((section("sfrs"),address(0xBF88C1D4)));
extern volatile uint32_t        C2RXF9SET __attribute__((section("sfrs"),address(0xBF88C1D8)));
extern volatile uint32_t        C2RXF9INV __attribute__((section("sfrs"),address(0xBF88C1DC)));
#define C2RXF10 C2RXF10
extern volatile uint32_t   C2RXF10 __attribute__((section("sfrs"), address(0xBF88C1E0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF10bits_t;
extern volatile __C2RXF10bits_t C2RXF10bits __asm__ ("C2RXF10") __attribute__((section("sfrs"), address(0xBF88C1E0)));
extern volatile uint32_t        C2RXF10CLR __attribute__((section("sfrs"),address(0xBF88C1E4)));
extern volatile uint32_t        C2RXF10SET __attribute__((section("sfrs"),address(0xBF88C1E8)));
extern volatile uint32_t        C2RXF10INV __attribute__((section("sfrs"),address(0xBF88C1EC)));
#define C2RXF11 C2RXF11
extern volatile uint32_t   C2RXF11 __attribute__((section("sfrs"), address(0xBF88C1F0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF11bits_t;
extern volatile __C2RXF11bits_t C2RXF11bits __asm__ ("C2RXF11") __attribute__((section("sfrs"), address(0xBF88C1F0)));
extern volatile uint32_t        C2RXF11CLR __attribute__((section("sfrs"),address(0xBF88C1F4)));
extern volatile uint32_t        C2RXF11SET __attribute__((section("sfrs"),address(0xBF88C1F8)));
extern volatile uint32_t        C2RXF11INV __attribute__((section("sfrs"),address(0xBF88C1FC)));
#define C2RXF12 C2RXF12
extern volatile uint32_t   C2RXF12 __attribute__((section("sfrs"), address(0xBF88C200)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF12bits_t;
