MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f256h.h
extern volatile __C2FIFOINT19bits_t C2FIFOINT19bits __asm__ ("C2FIFOINT19") __attribute__((section("sfrs"), address(0xBF88C820)));
extern volatile uint32_t        C2FIFOINT19CLR __attribute__((section("sfrs"),address(0xBF88C824)));
extern volatile uint32_t        C2FIFOINT19SET __attribute__((section("sfrs"),address(0xBF88C828)));
extern volatile uint32_t        C2FIFOINT19INV __attribute__((section("sfrs"),address(0xBF88C82C)));
#define C2FIFOUA19 C2FIFOUA19
extern volatile uint32_t   C2FIFOUA19 __attribute__((section("sfrs"), address(0xBF88C830)));
extern volatile uint32_t        C2FIFOUA19CLR __attribute__((section("sfrs"),address(0xBF88C834)));
extern volatile uint32_t        C2FIFOUA19SET __attribute__((section("sfrs"),address(0xBF88C838)));
extern volatile uint32_t        C2FIFOUA19INV __attribute__((section("sfrs"),address(0xBF88C83C)));
#define C2FIFOCI19 C2FIFOCI19
extern volatile uint32_t   C2FIFOCI19 __attribute__((section("sfrs"), address(0xBF88C840)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI19bits_t;
extern volatile __C2FIFOCI19bits_t C2FIFOCI19bits __asm__ ("C2FIFOCI19") __attribute__((section("sfrs"), address(0xBF88C840)));
extern volatile uint32_t        C2FIFOCI19CLR __attribute__((section("sfrs"),address(0xBF88C844)));
extern volatile uint32_t        C2FIFOCI19SET __attribute__((section("sfrs"),address(0xBF88C848)));
extern volatile uint32_t        C2FIFOCI19INV __attribute__((section("sfrs"),address(0xBF88C84C)));
#define C2FIFOCON20 C2FIFOCON20
extern volatile uint32_t   C2FIFOCON20 __attribute__((section("sfrs"), address(0xBF88C850)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON20bits_t;
extern volatile __C2FIFOCON20bits_t C2FIFOCON20bits __asm__ ("C2FIFOCON20") __attribute__((section("sfrs"), address(0xBF88C850)));
extern volatile uint32_t        C2FIFOCON20CLR __attribute__((section("sfrs"),address(0xBF88C854)));
extern volatile uint32_t        C2FIFOCON20SET __attribute__((section("sfrs"),address(0xBF88C858)));
extern volatile uint32_t        C2FIFOCON20INV __attribute__((section("sfrs"),address(0xBF88C85C)));
#define C2FIFOINT20 C2FIFOINT20
extern volatile uint32_t   C2FIFOINT20 __attribute__((section("sfrs"), address(0xBF88C860)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT20bits_t;
extern volatile __C2FIFOINT20bits_t C2FIFOINT20bits __asm__ ("C2FIFOINT20") __attribute__((section("sfrs"), address(0xBF88C860)));
extern volatile uint32_t        C2FIFOINT20CLR __attribute__((section("sfrs"),address(0xBF88C864)));
extern volatile uint32_t        C2FIFOINT20SET __attribute__((section("sfrs"),address(0xBF88C868)));
extern volatile uint32_t        C2FIFOINT20INV __attribute__((section("sfrs"),address(0xBF88C86C)));
#define C2FIFOUA20 C2FIFOUA20
extern volatile uint32_t   C2FIFOUA20 __attribute__((section("sfrs"), address(0xBF88C870)));
extern volatile uint32_t        C2FIFOUA20CLR __attribute__((section("sfrs"),address(0xBF88C874)));
extern volatile uint32_t        C2FIFOUA20SET __attribute__((section("sfrs"),address(0xBF88C878)));
extern volatile uint32_t        C2FIFOUA20INV __attribute__((section("sfrs"),address(0xBF88C87C)));
#define C2FIFOCI20 C2FIFOCI20
extern volatile uint32_t   C2FIFOCI20 __attribute__((section("sfrs"), address(0xBF88C880)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI20bits_t;
extern volatile __C2FIFOCI20bits_t C2FIFOCI20bits __asm__ ("C2FIFOCI20") __attribute__((section("sfrs"), address(0xBF88C880)));
extern volatile uint32_t        C2FIFOCI20CLR __attribute__((section("sfrs"),address(0xBF88C884)));
extern volatile uint32_t        C2FIFOCI20SET __attribute__((section("sfrs"),address(0xBF88C888)));
extern volatile uint32_t        C2FIFOCI20INV __attribute__((section("sfrs"),address(0xBF88C88C)));
#define C2FIFOCON21 C2FIFOCON21
extern volatile uint32_t   C2FIFOCON21 __attribute__((section("sfrs"), address(0xBF88C890)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON21bits_t;
extern volatile __C2FIFOCON21bits_t C2FIFOCON21bits __asm__ ("C2FIFOCON21") __attribute__((section("sfrs"), address(0xBF88C890)));
extern volatile uint32_t        C2FIFOCON21CLR __attribute__((section("sfrs"),address(0xBF88C894)));
extern volatile uint32_t        C2FIFOCON21SET __attribute__((section("sfrs"),address(0xBF88C898)));
extern volatile uint32_t        C2FIFOCON21INV __attribute__((section("sfrs"),address(0xBF88C89C)));
#define C2FIFOINT21 C2FIFOINT21
extern volatile uint32_t   C2FIFOINT21 __attribute__((section("sfrs"), address(0xBF88C8A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT21bits_t;
extern volatile __C2FIFOINT21bits_t C2FIFOINT21bits __asm__ ("C2FIFOINT21") __attribute__((section("sfrs"), address(0xBF88C8A0)));
extern volatile uint32_t        C2FIFOINT21CLR __attribute__((section("sfrs"),address(0xBF88C8A4)));
extern volatile uint32_t        C2FIFOINT21SET __attribute__((section("sfrs"),address(0xBF88C8A8)));
extern volatile uint32_t        C2FIFOINT21INV __attribute__((section("sfrs"),address(0xBF88C8AC)));
#define C2FIFOUA21 C2FIFOUA21
extern volatile uint32_t   C2FIFOUA21 __attribute__((section("sfrs"), address(0xBF88C8B0)));
extern volatile uint32_t        C2FIFOUA21CLR __attribute__((section("sfrs"),address(0xBF88C8B4)));
extern volatile uint32_t        C2FIFOUA21SET __attribute__((section("sfrs"),address(0xBF88C8B8)));
extern volatile uint32_t        C2FIFOUA21INV __attribute__((section("sfrs"),address(0xBF88C8BC)));
#define C2FIFOCI21 C2FIFOCI21
extern volatile uint32_t   C2FIFOCI21 __attribute__((section("sfrs"), address(0xBF88C8C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI21bits_t;
extern volatile __C2FIFOCI21bits_t C2FIFOCI21bits __asm__ ("C2FIFOCI21") __attribute__((section("sfrs"), address(0xBF88C8C0)));
extern volatile uint32_t        C2FIFOCI21CLR __attribute__((section("sfrs"),address(0xBF88C8C4)));
extern volatile uint32_t        C2FIFOCI21SET __attribute__((section("sfrs"),address(0xBF88C8C8)));
extern volatile uint32_t        C2FIFOCI21INV __attribute__((section("sfrs"),address(0xBF88C8CC)));
#define C2FIFOCON22 C2FIFOCON22
extern volatile uint32_t   C2FIFOCON22 __attribute__((section("sfrs"), address(0xBF88C8D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON22bits_t;
extern volatile __C2FIFOCON22bits_t C2FIFOCON22bits __asm__ ("C2FIFOCON22") __attribute__((section("sfrs"), address(0xBF88C8D0)));
extern volatile uint32_t        C2FIFOCON22CLR __attribute__((section("sfrs"),address(0xBF88C8D4)));
extern volatile uint32_t        C2FIFOCON22SET __attribute__((section("sfrs"),address(0xBF88C8D8)));
extern volatile uint32_t        C2FIFOCON22INV __attribute__((section("sfrs"),address(0xBF88C8DC)));
#define C2FIFOINT22 C2FIFOINT22
extern volatile uint32_t   C2FIFOINT22 __attribute__((section("sfrs"), address(0xBF88C8E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT22bits_t;
extern volatile __C2FIFOINT22bits_t C2FIFOINT22bits __asm__ ("C2FIFOINT22") __attribute__((section("sfrs"), address(0xBF88C8E0)));
extern volatile uint32_t        C2FIFOINT22CLR __attribute__((section("sfrs"),address(0xBF88C8E4)));
extern volatile uint32_t        C2FIFOINT22SET __attribute__((section("sfrs"),address(0xBF88C8E8)));
extern volatile uint32_t        C2FIFOINT22INV __attribute__((section("sfrs"),address(0xBF88C8EC)));
#define C2FIFOUA22 C2FIFOUA22
extern volatile uint32_t   C2FIFOUA22 __attribute__((section("sfrs"), address(0xBF88C8F0)));
extern volatile uint32_t        C2FIFOUA22CLR __attribute__((section("sfrs"),address(0xBF88C8F4)));
extern volatile uint32_t        C2FIFOUA22SET __attribute__((section("sfrs"),address(0xBF88C8F8)));
extern volatile uint32_t        C2FIFOUA22INV __attribute__((section("sfrs"),address(0xBF88C8FC)));
#define C2FIFOCI22 C2FIFOCI22
extern volatile uint32_t   C2FIFOCI22 __attribute__((section("sfrs"), address(0xBF88C900)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI22bits_t;
