MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f256h.h
extern volatile __C2FIFOCI22bits_t C2FIFOCI22bits __asm__ ("C2FIFOCI22") __attribute__((section("sfrs"), address(0xBF88C900)));
extern volatile uint32_t        C2FIFOCI22CLR __attribute__((section("sfrs"),address(0xBF88C904)));
extern volatile uint32_t        C2FIFOCI22SET __attribute__((section("sfrs"),address(0xBF88C908)));
extern volatile uint32_t        C2FIFOCI22INV __attribute__((section("sfrs"),address(0xBF88C90C)));
#define C2FIFOCON23 C2FIFOCON23
extern volatile uint32_t   C2FIFOCON23 __attribute__((section("sfrs"), address(0xBF88C910)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON23bits_t;
extern volatile __C2FIFOCON23bits_t C2FIFOCON23bits __asm__ ("C2FIFOCON23") __attribute__((section("sfrs"), address(0xBF88C910)));
extern volatile uint32_t        C2FIFOCON23CLR __attribute__((section("sfrs"),address(0xBF88C914)));
extern volatile uint32_t        C2FIFOCON23SET __attribute__((section("sfrs"),address(0xBF88C918)));
extern volatile uint32_t        C2FIFOCON23INV __attribute__((section("sfrs"),address(0xBF88C91C)));
#define C2FIFOINT23 C2FIFOINT23
extern volatile uint32_t   C2FIFOINT23 __attribute__((section("sfrs"), address(0xBF88C920)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT23bits_t;
extern volatile __C2FIFOINT23bits_t C2FIFOINT23bits __asm__ ("C2FIFOINT23") __attribute__((section("sfrs"), address(0xBF88C920)));
extern volatile uint32_t        C2FIFOINT23CLR __attribute__((section("sfrs"),address(0xBF88C924)));
extern volatile uint32_t        C2FIFOINT23SET __attribute__((section("sfrs"),address(0xBF88C928)));
extern volatile uint32_t        C2FIFOINT23INV __attribute__((section("sfrs"),address(0xBF88C92C)));
#define C2FIFOUA23 C2FIFOUA23
extern volatile uint32_t   C2FIFOUA23 __attribute__((section("sfrs"), address(0xBF88C930)));
extern volatile uint32_t        C2FIFOUA23CLR __attribute__((section("sfrs"),address(0xBF88C934)));
extern volatile uint32_t        C2FIFOUA23SET __attribute__((section("sfrs"),address(0xBF88C938)));
extern volatile uint32_t        C2FIFOUA23INV __attribute__((section("sfrs"),address(0xBF88C93C)));
#define C2FIFOCI23 C2FIFOCI23
extern volatile uint32_t   C2FIFOCI23 __attribute__((section("sfrs"), address(0xBF88C940)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI23bits_t;
extern volatile __C2FIFOCI23bits_t C2FIFOCI23bits __asm__ ("C2FIFOCI23") __attribute__((section("sfrs"), address(0xBF88C940)));
extern volatile uint32_t        C2FIFOCI23CLR __attribute__((section("sfrs"),address(0xBF88C944)));
extern volatile uint32_t        C2FIFOCI23SET __attribute__((section("sfrs"),address(0xBF88C948)));
extern volatile uint32_t        C2FIFOCI23INV __attribute__((section("sfrs"),address(0xBF88C94C)));
#define C2FIFOCON24 C2FIFOCON24
extern volatile uint32_t   C2FIFOCON24 __attribute__((section("sfrs"), address(0xBF88C950)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON24bits_t;
extern volatile __C2FIFOCON24bits_t C2FIFOCON24bits __asm__ ("C2FIFOCON24") __attribute__((section("sfrs"), address(0xBF88C950)));
extern volatile uint32_t        C2FIFOCON24CLR __attribute__((section("sfrs"),address(0xBF88C954)));
extern volatile uint32_t        C2FIFOCON24SET __attribute__((section("sfrs"),address(0xBF88C958)));
extern volatile uint32_t        C2FIFOCON24INV __attribute__((section("sfrs"),address(0xBF88C95C)));
#define C2FIFOINT24 C2FIFOINT24
extern volatile uint32_t   C2FIFOINT24 __attribute__((section("sfrs"), address(0xBF88C960)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT24bits_t;
extern volatile __C2FIFOINT24bits_t C2FIFOINT24bits __asm__ ("C2FIFOINT24") __attribute__((section("sfrs"), address(0xBF88C960)));
extern volatile uint32_t        C2FIFOINT24CLR __attribute__((section("sfrs"),address(0xBF88C964)));
extern volatile uint32_t        C2FIFOINT24SET __attribute__((section("sfrs"),address(0xBF88C968)));
extern volatile uint32_t        C2FIFOINT24INV __attribute__((section("sfrs"),address(0xBF88C96C)));
#define C2FIFOUA24 C2FIFOUA24
extern volatile uint32_t   C2FIFOUA24 __attribute__((section("sfrs"), address(0xBF88C970)));
extern volatile uint32_t        C2FIFOUA24CLR __attribute__((section("sfrs"),address(0xBF88C974)));
extern volatile uint32_t        C2FIFOUA24SET __attribute__((section("sfrs"),address(0xBF88C978)));
extern volatile uint32_t        C2FIFOUA24INV __attribute__((section("sfrs"),address(0xBF88C97C)));
#define C2FIFOCI24 C2FIFOCI24
extern volatile uint32_t   C2FIFOCI24 __attribute__((section("sfrs"), address(0xBF88C980)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI24bits_t;
extern volatile __C2FIFOCI24bits_t C2FIFOCI24bits __asm__ ("C2FIFOCI24") __attribute__((section("sfrs"), address(0xBF88C980)));
extern volatile uint32_t        C2FIFOCI24CLR __attribute__((section("sfrs"),address(0xBF88C984)));
extern volatile uint32_t        C2FIFOCI24SET __attribute__((section("sfrs"),address(0xBF88C988)));
extern volatile uint32_t        C2FIFOCI24INV __attribute__((section("sfrs"),address(0xBF88C98C)));
#define C2FIFOCON25 C2FIFOCON25
extern volatile uint32_t   C2FIFOCON25 __attribute__((section("sfrs"), address(0xBF88C990)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON25bits_t;
extern volatile __C2FIFOCON25bits_t C2FIFOCON25bits __asm__ ("C2FIFOCON25") __attribute__((section("sfrs"), address(0xBF88C990)));
extern volatile uint32_t        C2FIFOCON25CLR __attribute__((section("sfrs"),address(0xBF88C994)));
extern volatile uint32_t        C2FIFOCON25SET __attribute__((section("sfrs"),address(0xBF88C998)));
extern volatile uint32_t        C2FIFOCON25INV __attribute__((section("sfrs"),address(0xBF88C99C)));
#define C2FIFOINT25 C2FIFOINT25
extern volatile uint32_t   C2FIFOINT25 __attribute__((section("sfrs"), address(0xBF88C9A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT25bits_t;
extern volatile __C2FIFOINT25bits_t C2FIFOINT25bits __asm__ ("C2FIFOINT25") __attribute__((section("sfrs"), address(0xBF88C9A0)));
extern volatile uint32_t        C2FIFOINT25CLR __attribute__((section("sfrs"),address(0xBF88C9A4)));
extern volatile uint32_t        C2FIFOINT25SET __attribute__((section("sfrs"),address(0xBF88C9A8)));
extern volatile uint32_t        C2FIFOINT25INV __attribute__((section("sfrs"),address(0xBF88C9AC)));
#define C2FIFOUA25 C2FIFOUA25
extern volatile uint32_t   C2FIFOUA25 __attribute__((section("sfrs"), address(0xBF88C9B0)));
extern volatile uint32_t        C2FIFOUA25CLR __attribute__((section("sfrs"),address(0xBF88C9B4)));
extern volatile uint32_t        C2FIFOUA25SET __attribute__((section("sfrs"),address(0xBF88C9B8)));
extern volatile uint32_t        C2FIFOUA25INV __attribute__((section("sfrs"),address(0xBF88C9BC)));
#define C2FIFOCI25 C2FIFOCI25
extern volatile uint32_t   C2FIFOCI25 __attribute__((section("sfrs"), address(0xBF88C9C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI25bits_t;
extern volatile __C2FIFOCI25bits_t C2FIFOCI25bits __asm__ ("C2FIFOCI25") __attribute__((section("sfrs"), address(0xBF88C9C0)));
extern volatile uint32_t        C2FIFOCI25CLR __attribute__((section("sfrs"),address(0xBF88C9C4)));
extern volatile uint32_t        C2FIFOCI25SET __attribute__((section("sfrs"),address(0xBF88C9C8)));
extern volatile uint32_t        C2FIFOCI25INV __attribute__((section("sfrs"),address(0xBF88C9CC)));
#define C2FIFOCON26 C2FIFOCON26
extern volatile uint32_t   C2FIFOCON26 __attribute__((section("sfrs"), address(0xBF88C9D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON26bits_t;
extern volatile __C2FIFOCON26bits_t C2FIFOCON26bits __asm__ ("C2FIFOCON26") __attribute__((section("sfrs"), address(0xBF88C9D0)));
extern volatile uint32_t        C2FIFOCON26CLR __attribute__((section("sfrs"),address(0xBF88C9D4)));
extern volatile uint32_t        C2FIFOCON26SET __attribute__((section("sfrs"),address(0xBF88C9D8)));
extern volatile uint32_t        C2FIFOCON26INV __attribute__((section("sfrs"),address(0xBF88C9DC)));
#define C2FIFOINT26 C2FIFOINT26
extern volatile uint32_t   C2FIFOINT26 __attribute__((section("sfrs"), address(0xBF88C9E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT26bits_t;
extern volatile __C2FIFOINT26bits_t C2FIFOINT26bits __asm__ ("C2FIFOINT26") __attribute__((section("sfrs"), address(0xBF88C9E0)));
extern volatile uint32_t        C2FIFOINT26CLR __attribute__((section("sfrs"),address(0xBF88C9E4)));
extern volatile uint32_t        C2FIFOINT26SET __attribute__((section("sfrs"),address(0xBF88C9E8)));
extern volatile uint32_t        C2FIFOINT26INV __attribute__((section("sfrs"),address(0xBF88C9EC)));
#define C2FIFOUA26 C2FIFOUA26
extern volatile uint32_t   C2FIFOUA26 __attribute__((section("sfrs"), address(0xBF88C9F0)));
extern volatile uint32_t        C2FIFOUA26CLR __attribute__((section("sfrs"),address(0xBF88C9F4)));
extern volatile uint32_t        C2FIFOUA26SET __attribute__((section("sfrs"),address(0xBF88C9F8)));
extern volatile uint32_t        C2FIFOUA26INV __attribute__((section("sfrs"),address(0xBF88C9FC)));
#define C2FIFOCI26 C2FIFOCI26
extern volatile uint32_t   C2FIFOCI26 __attribute__((section("sfrs"), address(0xBF88CA00)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI26bits_t;
