MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f256h.h
extern volatile __C2FIFOCI28bits_t C2FIFOCI28bits __asm__ ("C2FIFOCI28") __attribute__((section("sfrs"), address(0xBF88CA80)));
extern volatile uint32_t        C2FIFOCI28CLR __attribute__((section("sfrs"),address(0xBF88CA84)));
extern volatile uint32_t        C2FIFOCI28SET __attribute__((section("sfrs"),address(0xBF88CA88)));
extern volatile uint32_t        C2FIFOCI28INV __attribute__((section("sfrs"),address(0xBF88CA8C)));
#define C2FIFOCON29 C2FIFOCON29
extern volatile uint32_t   C2FIFOCON29 __attribute__((section("sfrs"), address(0xBF88CA90)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON29bits_t;
extern volatile __C2FIFOCON29bits_t C2FIFOCON29bits __asm__ ("C2FIFOCON29") __attribute__((section("sfrs"), address(0xBF88CA90)));
extern volatile uint32_t        C2FIFOCON29CLR __attribute__((section("sfrs"),address(0xBF88CA94)));
extern volatile uint32_t        C2FIFOCON29SET __attribute__((section("sfrs"),address(0xBF88CA98)));
extern volatile uint32_t        C2FIFOCON29INV __attribute__((section("sfrs"),address(0xBF88CA9C)));
#define C2FIFOINT29 C2FIFOINT29
extern volatile uint32_t   C2FIFOINT29 __attribute__((section("sfrs"), address(0xBF88CAA0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT29bits_t;
extern volatile __C2FIFOINT29bits_t C2FIFOINT29bits __asm__ ("C2FIFOINT29") __attribute__((section("sfrs"), address(0xBF88CAA0)));
extern volatile uint32_t        C2FIFOINT29CLR __attribute__((section("sfrs"),address(0xBF88CAA4)));
extern volatile uint32_t        C2FIFOINT29SET __attribute__((section("sfrs"),address(0xBF88CAA8)));
extern volatile uint32_t        C2FIFOINT29INV __attribute__((section("sfrs"),address(0xBF88CAAC)));
#define C2FIFOUA29 C2FIFOUA29
extern volatile uint32_t   C2FIFOUA29 __attribute__((section("sfrs"), address(0xBF88CAB0)));
extern volatile uint32_t        C2FIFOUA29CLR __attribute__((section("sfrs"),address(0xBF88CAB4)));
extern volatile uint32_t        C2FIFOUA29SET __attribute__((section("sfrs"),address(0xBF88CAB8)));
extern volatile uint32_t        C2FIFOUA29INV __attribute__((section("sfrs"),address(0xBF88CABC)));
#define C2FIFOCI29 C2FIFOCI29
extern volatile uint32_t   C2FIFOCI29 __attribute__((section("sfrs"), address(0xBF88CAC0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI29bits_t;
extern volatile __C2FIFOCI29bits_t C2FIFOCI29bits __asm__ ("C2FIFOCI29") __attribute__((section("sfrs"), address(0xBF88CAC0)));
extern volatile uint32_t        C2FIFOCI29CLR __attribute__((section("sfrs"),address(0xBF88CAC4)));
extern volatile uint32_t        C2FIFOCI29SET __attribute__((section("sfrs"),address(0xBF88CAC8)));
extern volatile uint32_t        C2FIFOCI29INV __attribute__((section("sfrs"),address(0xBF88CACC)));
#define C2FIFOCON30 C2FIFOCON30
extern volatile uint32_t   C2FIFOCON30 __attribute__((section("sfrs"), address(0xBF88CAD0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON30bits_t;
extern volatile __C2FIFOCON30bits_t C2FIFOCON30bits __asm__ ("C2FIFOCON30") __attribute__((section("sfrs"), address(0xBF88CAD0)));
extern volatile uint32_t        C2FIFOCON30CLR __attribute__((section("sfrs"),address(0xBF88CAD4)));
extern volatile uint32_t        C2FIFOCON30SET __attribute__((section("sfrs"),address(0xBF88CAD8)));
extern volatile uint32_t        C2FIFOCON30INV __attribute__((section("sfrs"),address(0xBF88CADC)));
#define C2FIFOINT30 C2FIFOINT30
extern volatile uint32_t   C2FIFOINT30 __attribute__((section("sfrs"), address(0xBF88CAE0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT30bits_t;
extern volatile __C2FIFOINT30bits_t C2FIFOINT30bits __asm__ ("C2FIFOINT30") __attribute__((section("sfrs"), address(0xBF88CAE0)));
extern volatile uint32_t        C2FIFOINT30CLR __attribute__((section("sfrs"),address(0xBF88CAE4)));
extern volatile uint32_t        C2FIFOINT30SET __attribute__((section("sfrs"),address(0xBF88CAE8)));
extern volatile uint32_t        C2FIFOINT30INV __attribute__((section("sfrs"),address(0xBF88CAEC)));
#define C2FIFOUA30 C2FIFOUA30
extern volatile uint32_t   C2FIFOUA30 __attribute__((section("sfrs"), address(0xBF88CAF0)));
extern volatile uint32_t        C2FIFOUA30CLR __attribute__((section("sfrs"),address(0xBF88CAF4)));
extern volatile uint32_t        C2FIFOUA30SET __attribute__((section("sfrs"),address(0xBF88CAF8)));
extern volatile uint32_t        C2FIFOUA30INV __attribute__((section("sfrs"),address(0xBF88CAFC)));
#define C2FIFOCI30 C2FIFOCI30
extern volatile uint32_t   C2FIFOCI30 __attribute__((section("sfrs"), address(0xBF88CB00)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI30bits_t;
